### jupyter 사용방법
* h :help
- a,b:셀추가
* m,y :마크업 또는 코드
* dd : 셀 한칸 삭제
* 컨트롤 + 엔터 : 실행

##### pandas 불러옴

In [71]:

import pandas as pd

##### 데이터 읽기

In [72]:
df = pd.read_csv("data/1.pandas.csv")

In [73]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [74]:
name = '홍길동'
age = 20;
name
age

20

##### [ ] 대괄호 하나만 치면  1차원 배열로 만들어지면 시리즈(Series)

In [75]:
print(df['name']) 
print(df.age)

0     Kim
1     Cho
2    Choi
3      jo
Name: name, dtype: object
0    20
1    30
2    40
3    50
Name: age, dtype: int64

##### [[]] 두개치면 이차원 배열(DataFrame) >> 여러개의 값을 한번가져올때 사용

In [76]:
print(df[['name','age']])

   name  age
0   Kim   20
1   Cho   30
2  Choi   40
3    jo   50

##### 인덱싱 : 인덱스의 범위를 지정한다

In [77]:
print("--- 인덱싱 ---")
print(df[1:3]) #1~2 까지의 데이터
print(df[:3]) # 처음(0)부터 3번째 전까지(2)

--- 인덱싱 ---
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40

##### loc : dataFrame.loc[ index조건식, 컬럼 조건식 ]

In [78]:
print("--- LOC ---")
print(df.loc[1:3,'score']) # 3번까지 포함시킨당
print(df.loc[1:3,['name','score']])
print(df.loc[:,'name':'grade']) #뒤쪽의 : 은 생략가능이다
print(df.loc[:, ]) # 다 가져오는거

--- LOC ---
1    95.0
2    90.5
3    85.7
Name: score, dtype: float64
   name  score
1   Cho   95.0
2  Choi   90.5
3    jo   85.7
   name  score grade
0   Kim  100.0     A
1   Cho   95.0     A
2  Choi   90.5     B
3    jo   85.7     B
   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [79]:
print("===============")
print( df['grade']=='A') # 비교하는값은 T또는F가 나온다
print( df[df['grade']=='A']) #위랑 관련되어있는 트루의 정보값만 가져온다

===============
0     True
1     True
2    False
3    False
Name: grade, dtype: bool
  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

### 2 DataFrame 삭제
* 인덱스를 기준으로 행 삭제

In [80]:
df.drop(2)

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30
3   jo   85.7     B   50

In [81]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [82]:
df = df.drop(3)
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40

In [83]:
df.drop(1,inplace = True)
# 삭제한후 다시 자기자신한테 저장

In [84]:
df

   name  score grade  age
0   Kim  100.0     A   20
2  Choi   90.5     B   40

#### axis
* 열 또는 행 중에 어떠한 값을 기준으로 설정할지 결정
* axis는 기본적으로 행(index)로 설정되면 axis = 0 이다
* axis = 0 : index 삭제
* axis = 1 : 컬럼, 열 삭제

In [85]:
import pandas

In [86]:
df = pd.read_csv("data/1.pandas.csv")

In [87]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [88]:
df.drop("score", axis=1, inplace = True)

In [89]:
df

   name grade  age
0   Kim     A   20
1   Cho     A   30
2  Choi     B   40
3    jo     B   50

### 3 Boolean 처리
* 특정 데이터 연산하면 결과는 True, False 이다
* DataFrame에 True값을 전달하면 해당 위치의 값들을 얻어온다

In [90]:
df = pd.read_csv('data/1.pandas.csv')
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [91]:
df['score']

0    100.0
1     95.0
2     90.5
3     85.7
Name: score, dtype: float64

In [92]:
df[df['score'] < 95] # true인 결과값만 가져온다~

   name  score grade  age
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [93]:
df[df['score'] < 95]['name']

2    Choi
3      jo
Name: name, dtype: object

In [94]:
df[df['score'] < 95][['name','score']]

   name  score
2  Choi   90.5
3    jo   85.7

In [95]:
df.loc[:,['name','score']]

   name  score
0   Kim  100.0
1   Cho   95.0
2  Choi   90.5
3    jo   85.7

In [96]:
df.loc[df['score'] < 95,['name','score']]

   name  score
2  Choi   90.5
3    jo   85.7

In [97]:
df.loc[df['score']<95,'name':'grade']

   name  score grade
2  Choi   90.5     B
3    jo   85.7     B

In [98]:
df['name']

0     Kim
1     Cho
2    Choi
3      jo
Name: name, dtype: object

In [99]:
print('이렇게너무나도졸린데우짜쥬')

이렇게너무나도졸린데우짜쥬

In [100]:
df[df['score']<95].loc[:,'name':'grade']

   name  score grade
2  Choi   90.5     B
3    jo   85.7     B

### 4 DataFrame 명렁어

In [101]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [102]:
df.columns

Index(['name', 'score', 'grade', 'age'], dtype='object')

In [103]:
df.values

array([['Kim', 100.0, 'A', 20],
       ['Cho', 95.0, 'A', 30],
       ['Choi', 90.5, 'B', 40],
       ['jo', 85.7, 'B', 50]], dtype=object)

* dtypes
    - 자료형을 알려준다
    - object : 문자열
    - float : 실수
    - int : 정수

In [104]:
df.dtypes

name      object
score    float64
grade     object
age        int64
dtype: object

In [105]:
df['grade']

0    A
1    A
2    B
3    B
Name: grade, dtype: object

In [106]:
df['grade'].isin(['A'])

0     True
1     True
2    False
3    False
Name: grade, dtype: bool

In [107]:
df[df['grade'].isin(['A'])]

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

In [108]:
df.loc[df['grade'].isin(['A']),['name','grade']]

  name grade
0  Kim     A
1  Cho     A

In [109]:
index_name = ['김씨','최씨','초이씨','조씨']
df.index = index_name
df

     name  score grade  age
김씨    Kim  100.0     A   20
최씨    Cho   95.0     A   30
초이씨  Choi   90.5     B   40
조씨     jo   85.7     B   50

In [110]:
df[1:3]

     name  score grade  age
최씨    Cho   95.0     A   30
초이씨  Choi   90.5     B   40

In [111]:
df['최씨':'조씨']

     name  score grade  age
최씨    Cho   95.0     A   30
초이씨  Choi   90.5     B   40
조씨     jo   85.7     B   50